# Pandas
Pandas is an open-source Python Library providing high-performance data manipulation and analysis tool using its powerful data structures
It is a popular Python package for data science, and with good reason: it offers powerful, expressive and flexible data structures that make data manipulation and analysis easy, among many other things.

In [1]:
#importing libraries
import pandas as pd
import sys

In [3]:
#check versions--
print('Python version ' , sys.version)
print('Pandas version ' , pd.__version__)

Python version  3.6.4 |Anaconda, Inc.| (default, Jan 16 2018, 10:22:32) [MSC v.1900 64 bit (AMD64)]
Pandas version  0.22.0

# DataStructures
Pandas deals with the following two data structures −

   1. Series
   2. DataFrame

Data Structure  	Dimensions 	Description
Series  	1 	1D labeled homogeneous array, sizeimmutable.
Data Frames 	2 	General 2D labeled, size-mutable tabular structure with potentially heterogeneously typed columns.

Series

Series is a one-dimensional labelled array like structure with homogeneous data. For example, the following series is a collection of integers 10, 23, 56, …

#syntax:
pandas.Series( data, index, dtype, copy)

In [2]:
#creating empty series
import pandas as pd
s = pd.Series()
s

Series([], dtype: float64)

In [3]:
s1 = pd.Series([1,2,3,4])
s1

0    1
1    2
2    3
3    4
dtype: int64

In [5]:
#creating a series from n-dimensional array
#import the pandas library and aliasing as pd
import pandas as pd
import numpy as np
data = np.array(['w','x','y','z'])
s = pd.Series(data, name='series1')
print(s)
s[-4:-1]

0    w
1    x
2    y
3    z
Name: series1, dtype: object

0    w
1    x
2    y
Name: series1, dtype: object

In [6]:
s1=pd.Series([2,3,4,5], index=[10,11,12,13],copy=True)
print(s1)

10    2
11    3
12    4
13    5
dtype: int64

In [8]:
import numpy as np
data=np.array([3,4,1,"3"])
s=pd.Series(data, index=[10,112,122,"b"],copy=True)
print(s)

10     3
112    4
122    1
b      3
dtype: object

In [10]:
s1.append(s,verify_integrity=True,ignore_index=True)

0    1
1    2
2    3
3    4
4    3
5    4
6    1
7    3
dtype: object

In [11]:
s3=s*s1
s3

0      NaN
1      NaN
2      NaN
3      NaN
10     NaN
112    NaN
122    NaN
b      NaN
dtype: object

In [14]:
s[1:]

11    4
12    1
18    6
dtype: int32

In [15]:
s[:-1]

10    3
11    4
12    1
dtype: int32

In [13]:
 s[1:] + s[:-1]

10    NaN
11    8.0
12    2.0
18    NaN
dtype: float64

We did not pass any index, so by default, it assigned the indexes ranging from 0 to len(data)-1, i.e., 0 to 3.

In [13]:
#import the pandas library and aliasing as pd
import pandas as pd
import numpy as np
data = np.array(['w','x','y','z'])
s = pd.Series(data,index=[100,101,"12.5",'d'],copy = True)
print(s)
s[[101,"d"]]

100     w
101     x
12.5    y
d       z
dtype: object

101    x
d      z
dtype: object

In [15]:
#creating series from dict
import pandas as pd
import numpy as np
data = {'a' : 0, 'b' : 1, 'c' : 2}
s = pd.Series(data)
s

a    0
b    1
c    2
dtype: int64

In [13]:
import numpy as np

In [14]:
#Creating a Series by passing a list of values, letting pandas create a default integer index:
s = pd.Series([1,3,5,np.nan ,6,8])
print(s)

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

In [6]:
s = pd.Series([1,3,5,6,8])
print(s)

0    1
1    3
2    5
3    6
4    8
dtype: int64

# Create data

The data set will consist of 5 baby names and the number of births recorded for that year (1880).

In [5]:
import pandas as pd

In [6]:
# The inital set of baby names and birth rates
names = ['Bob','Jessica','Mary','John','Mel']
births = [968, 155,77, 578, 973]

In [7]:
#to merge these two lists we use zip function
zip?

In [8]:
BabyDataSet = list(zip(names,births))
BabyDataSet

[('Bob', 968), ('Jessica', 155), ('Mary', 77), ('John', 578), ('Mel', 973)]

In [9]:
df = pd.DataFrame(data = BabyDataSet)
df

         0    1
0      Bob  968
1  Jessica  155
2     Mary   77
3     John  578
4      Mel  973



We are basically done creating the data set. We now will use the pandas library to export this data set into a csv file.

df will be a DataFrame object. You can think of this object holding the contents of the BabyDataSet in a format similar to a sql table or an excel spreadsheet. Lets take a look below at the contents inside df.

In [31]:


#Export the dataframe to a csv file. We can name the file births1880.csv. The function to_csv will be used to export the file.
#The file will be saved in the same location of the notebook unless specified otherwise.

df.to_csv?

The only parameters we will use is index and header. Setting these parameters to False will prevent the index and header names from being exported. Change the values of these parameters to get a better understanding of their use.

In [10]:
df.to_csv('births1880.csv',index=False,header=False)

# Get Data

To pull in the csv file, we will use the pandas function read_csv. Let us take a look at this function and what inputs it takes.

In [20]:
from pandas import DataFrame, read_csv
read_csv?

In [23]:
#Even though this functions has many parameters, we will simply pass it the location of the text file.
Location = r'C:\Users\dell\Untitled Folder\births1880.csv'
df = pd.read_csv(Location)
#Notice the r before the string. Since the slashes are special characters, prefixing the string with a r will escape the whole string.

In [24]:
df

       Bob  968
0  Jessica  155
1     Mary   77
2     John  578
3      Mel  973



This brings us to the first problem of the exercise. The read_csv function treated the first record in the csv file as the header names. This is obviously not correct since the text file did not provide us with header names.

To correct this we will pass the header parameter to the read_csv function and set it to None (means null in python).

In [26]:
df = pd.read_csv(Location, header=None)
df

         0    1
0      Bob  968
1  Jessica  155
2     Mary   77
3     John  578
4      Mel  973

In [27]:
#if we wanted to give the columns specific names, we would have to pass another paramter called names.
#We can also omit the header parameter.

df = pd.read_csv(Location, names=['Names','Births'])
df

     Names  Births
0      Bob     968
1  Jessica     155
2     Mary      77
3     John     578
4      Mel     973



You can think of the numbers [0,1,2,3,4] as the row numbers in an Excel file. In pandas these are part of the index of the dataframe. You can think of the index as the primary key of a sql table with the exception that an index is allowed to have duplicates.

[Names, Births] can be though of as column headers similar to the ones found in an Excel spreadsheet or sql database.

In [ ]:
#Delete the csv file now that we are done using it.

import os
os.remove(Location)

# Prepare Data

The data we have consists of baby names and the number of births in the year 1880. We already know that we have 5 records and none of the records are missing (non-null values).

The Names column at this point is of no concern since it most likely is just composed of alpha numeric strings (baby names). There is a chance of bad data in this column but we will not worry about that at this point of the analysis. The Births column should just contain integers representing the number of babies born in a specific year with a specific name. We can check if the all the data is of the data type integer. It would not make sense to have this column have a data type of float. I would not worry about any possible outliers at this point of the analysis.

Realize that aside from the check we did on the "Names" column, briefly looking at the data inside the dataframe should be as far as we need to go at this stage of the game. As we continue in the data analysis life cycle we will have plenty of opportunities to find any issues with the data set.

In [28]:
# Check data type of the columns
df.dtypes

Names     object
Births     int64
dtype: object

In [29]:
# Check data type of Births column
df.Births.dtype

dtype('int64')

# Analyze Data

To find the most popular name or the baby name with the higest birth rate, we can do one of the following.

    Sort the dataframe and select the top row
    Use the max() attribute to find the maximum value

In [11]:
# Method 1:
Sorted = df.sort_values(['Births'], ascending=False)
Sorted.head()

      name  Births    x
4      Mel     973  NaN
0      Bob     968  1.0
3     John     578  NaN
1  Jessica     155  2.0
2     Mary      77  NaN

In [12]:
# Method 2:
df['Births'].max()

973

In [13]:
df[1:2]

      name  Births    x
1  Jessica     155  2.0

In [33]:
import pandas as pd

In [34]:
#Creating a DataFrame by passing a numpy array, with a datetime index and labeled columns:
dates = pd.date_range('20130101', periods=6)
dates
import numpy as np

In [35]:
a = list("ABCDE")

In [36]:
a

['A', 'B', 'C', 'D', 'E']

In [37]:
df = pd.DataFrame(np.random.randn(6,4), index=dates, columns=list('ABCD'))
df

                   A         B         C         D
2013-01-01 -0.194382  1.274847 -0.710203  0.131801
2013-01-02 -1.060377  1.408031 -0.880430 -0.535771
2013-01-03 -0.124568  1.158580  1.479713 -0.358651
2013-01-04  1.494315  0.127926  0.868470 -0.863268
2013-01-05 -0.570439  1.100426 -0.448709  1.676371
2013-01-06  2.455644 -0.173071 -0.999105 -0.261260

In [59]:
df[1:3]

                   A         B         C         D
2013-01-02 -1.060377  1.408031 -0.880430 -0.535771
2013-01-03 -0.124568  1.158580  1.479713 -0.358651

In [61]:
df[::-2]

                   A         B         C         D
2013-01-06  2.455644 -0.173071 -0.999105 -0.261260
2013-01-04  1.494315  0.127926  0.868470 -0.863268
2013-01-02 -1.060377  1.408031 -0.880430 -0.535771

In [63]:
df[1:2:2]

                   A         B        C         D
2013-01-02 -1.060377  1.408031 -0.88043 -0.535771

In [66]:
 df3 = pd.DataFrame(np.random.randn(5, 4),
                      columns=list('ABCD'),
                       index=pd.date_range('20130101', periods=5))

In [68]:
df3

                   A         B         C         D
2013-01-01 -1.166108  1.389159 -0.649637  1.361139
2013-01-02 -0.615958 -0.651100 -0.334435 -0.383411
2013-01-03  0.985078  0.355507 -0.775949 -0.730708
2013-01-04  1.039181  0.937839 -0.941502 -0.033007
2013-01-05  2.432003  1.111491 -1.366181  1.068203

In [69]:
 df3.iloc[:3]

                   A         B         C         D
2013-01-01 -1.166108  1.389159 -0.649637  1.361139
2013-01-02 -0.615958 -0.651100 -0.334435 -0.383411
2013-01-03  0.985078  0.355507 -0.775949 -0.730708

In [72]:
df.iloc[1:3, 0:2]

                   A         B
2013-01-02 -1.060377  1.408031
2013-01-03 -0.124568  1.158580

In [73]:
df['A']

2013-01-01   -0.194382
2013-01-02   -1.060377
2013-01-03   -0.124568
2013-01-04    1.494315
2013-01-05   -0.570439
2013-01-06    2.455644
Freq: D, Name: A, dtype: float64

In [70]:
df3.loc['2013-01-01']

A   -1.166108
B    1.389159
C   -0.649637
D    1.361139
Name: 2013-01-01 00:00:00, dtype: float64

# Viewing Data¶

In [38]:
df.keys()

Index(['A', 'B', 'C', 'D'], dtype='object')

In [39]:
df.head(3)

                   A         B         C         D
2013-01-01 -0.194382  1.274847 -0.710203  0.131801
2013-01-02 -1.060377  1.408031 -0.880430 -0.535771
2013-01-03 -0.124568  1.158580  1.479713 -0.358651

In [40]:
df.tail()

                   A         B         C         D
2013-01-02 -1.060377  1.408031 -0.880430 -0.535771
2013-01-03 -0.124568  1.158580  1.479713 -0.358651
2013-01-04  1.494315  0.127926  0.868470 -0.863268
2013-01-05 -0.570439  1.100426 -0.448709  1.676371
2013-01-06  2.455644 -0.173071 -0.999105 -0.261260

In [41]:
#Display the index, columns, and the underlying numpy data
df.index

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [42]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [43]:
df.values

array([[-0.19438185,  1.27484744, -0.71020284,  0.13180098],
       [-1.0603775 ,  1.40803067, -0.88042992, -0.53577122],
       [-0.12456778,  1.15858032,  1.47971272, -0.35865083],
       [ 1.49431459,  0.12792574,  0.86847033, -0.86326848],
       [-0.57043928,  1.10042634, -0.44870873,  1.67637054],
       [ 2.45564433, -0.1730709 , -0.9991051 , -0.2612601 ]])

In [44]:
#Describe shows a quick statistic summary of your data
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean   0.333365  0.816123 -0.115044 -0.035130
std    1.349035  0.664982  1.033777  0.899928
min   -1.060377 -0.173071 -0.999105 -0.863268
25%   -0.476425  0.371051 -0.837873 -0.491491
50%   -0.159475  1.129503 -0.579456 -0.309955
75%    1.089594  1.245781  0.539176  0.033536
max    2.455644  1.408031  1.479713  1.676371

In [45]:
df1 = pd.DataFrame({ 'object': ['a', 'b', 'c'],
                     'numeric': [1, 2, 3],
                     'categorical': pd.Categorical(['d','e','f'])
                   })

In [46]:
df1

  object  numeric categorical
0      a        1           d
1      b        2           e
2      c        3           f

In [47]:
df1.describe(include='all')

       object  numeric categorical
count       3      3.0           3
unique      3      NaN           3
top         b      NaN           f
freq        1      NaN           1
mean      NaN      2.0         NaN
std       NaN      1.0         NaN
min       NaN      1.0         NaN
25%       NaN      1.5         NaN
50%       NaN      2.0         NaN
75%       NaN      2.5         NaN
max       NaN      3.0         NaN

In [48]:
df.sort_index(axis=0, ascending=True)

                   A         B         C         D
2013-01-01 -0.194382  1.274847 -0.710203  0.131801
2013-01-02 -1.060377  1.408031 -0.880430 -0.535771
2013-01-03 -0.124568  1.158580  1.479713 -0.358651
2013-01-04  1.494315  0.127926  0.868470 -0.863268
2013-01-05 -0.570439  1.100426 -0.448709  1.676371
2013-01-06  2.455644 -0.173071 -0.999105 -0.261260

In [49]:
#Sorting by an axis
df.sort_index(axis=1, ascending=False)

                   D         C         B         A
2013-01-01  0.131801 -0.710203  1.274847 -0.194382
2013-01-02 -0.535771 -0.880430  1.408031 -1.060377
2013-01-03 -0.358651  1.479713  1.158580 -0.124568
2013-01-04 -0.863268  0.868470  0.127926  1.494315
2013-01-05  1.676371 -0.448709  1.100426 -0.570439
2013-01-06 -0.261260 -0.999105 -0.173071  2.455644

In [50]:
#Sorting by values
df.sort_values(by='B')

                   A         B         C         D
2013-01-06  2.455644 -0.173071 -0.999105 -0.261260
2013-01-04  1.494315  0.127926  0.868470 -0.863268
2013-01-05 -0.570439  1.100426 -0.448709  1.676371
2013-01-03 -0.124568  1.158580  1.479713 -0.358651
2013-01-01 -0.194382  1.274847 -0.710203  0.131801
2013-01-02 -1.060377  1.408031 -0.880430 -0.535771

# Selection

In [54]:
 s = df['A']

In [55]:
s[dates[4]]

-0.5704392751525544

In [48]:
#Selecting via [], which slices the rows.
df[0:3]

                   A         B         C         D
2013-01-01  0.853369 -0.483861  0.910087  0.691602
2013-01-02 -0.502977 -0.160287  0.626926  1.509317
2013-01-03 -0.080302  1.262158 -0.552992  0.125925

In [50]:
df

                   A         B         C         D
2013-01-01  0.853369 -0.483861  0.910087  0.691602
2013-01-02 -0.502977 -0.160287  0.626926  1.509317
2013-01-03 -0.080302  1.262158 -0.552992  0.125925
2013-01-04 -1.195723  0.473676 -0.249032 -0.404953
2013-01-05  0.505069  0.644415 -0.236978 -0.627564
2013-01-06  0.067034  0.733854  1.511828  1.833408

In [83]:
df2 = pd.DataFrame([[1, 2], [4, 5], [7, 8]],
      index=['cobra', 'viper', 'sidewinder'],
      columns=['max_speed', 'shield'])

In [84]:
df2

            max_speed  shield
cobra               1       2
viper               4       5
sidewinder          7       8

In [86]:
df2['max_speed']

cobra         1
viper         4
sidewinder    7
Name: max_speed, dtype: int64

In [80]:
df2.iloc[0:2,1]

cobra    2
viper    5
Name: shield, dtype: int64

In [63]:
df2.loc['viper']

max_speed    4
shield       5
Name: viper, dtype: int64

In [49]:
df.loc[dates[1]]
#For getting a cross section using a label

A   -0.502977
B   -0.160287
C    0.626926
D    1.509317
Name: 2013-01-02 00:00:00, dtype: float64

In [64]:
df.iloc[0]

A    0.853369
B   -0.483861
C    0.910087
D    0.691602
Name: 2013-01-01 00:00:00, dtype: float64

In [40]:
df

                   A         B         C         D
2013-01-01  1.182422  0.014091  1.004240  0.520847
2013-01-02 -1.958628  0.708826  0.353156  0.937164
2013-01-03 -0.655771 -1.092226  0.566123 -0.449267
2013-01-04  0.327043  1.026301 -1.470094  0.975686
2013-01-05 -1.860304  2.129919 -0.564334  0.888277
2013-01-06 -0.081653  0.094066  0.220611  1.628207

In [41]:
#Using the isin() method for filtering:
df2 = df.copy()
df2['E'] = ['one', 'one','two','three','four','three']
df2

                   A         B         C         D      E
2013-01-01  1.182422  0.014091  1.004240  0.520847    one
2013-01-02 -1.958628  0.708826  0.353156  0.937164    one
2013-01-03 -0.655771 -1.092226  0.566123 -0.449267    two
2013-01-04  0.327043  1.026301 -1.470094  0.975686  three
2013-01-05 -1.860304  2.129919 -0.564334  0.888277   four
2013-01-06 -0.081653  0.094066  0.220611  1.628207  three

In [31]:
df2[df2['E'].isin(['two','four'])]

                   A         B         C         D     E
2013-01-03 -0.268685  1.063010 -0.271005  0.096774   two
2013-01-05  0.026005  0.393201 -0.636549 -1.064750  four